Revit 2027 API
ParameterTypeId.PointAdaptiveOrientationType Property
 "Orients to"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointAdaptiveOrientationType { get; }
Public Shared ReadOnly Property PointAdaptiveOrientationType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointAdaptiveOrientationType {
	ForgeTypeId^ get ();
}
static member PointAdaptiveOrientationType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace